Revit 2027 API
PartMakerMethodToDivideVolumes.ProfileOffset Property
 The offset which is applied to a family-defined profile in the direction away from the division line and toward left/upper part to obtain its profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ProfileOffset { get; set; }
Public Property ProfileOffset As Double
	Get
	Set
public:
property double ProfileOffset {
	double get ();
	void set (double value);
}
member ProfileOffset : float with get, set
Property Value
Double
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace